mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
/****************************************************************************
 * drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * NuttX OSAL shim for the NCS nrf_wifi firmware stack.
 *
 * Maps each nrf_wifi_osal_ops function pointer to the equivalent NuttX
 * primitive.  Only the ~30 ops exercised by the QSPI/FMAC path are
 * implemented with real bodies; the rest are stubbed with NULL or a
 * minimal no-op.  The linker will call out any missing symbols at build
 * time so the stubs can be filled in incrementally.
 *
 * Reference: NCS/zephyr/modules/nrf_wifi/os/shim.c
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdarg.h>
#include <stddef.h>
#include <limits.h>
#include <string.h>
#include <syslog.h>

#include <nuttx/irq.h>
#include <nuttx/spinlock.h>
#include <nuttx/kmalloc.h>
#include <nuttx/mutex.h>
#include <nuttx/clock.h>
#include <nuttx/signal.h>
#include <nuttx/wqueue.h>

#include "osal_ops.h"
#include "nrf7002_osal.h"
#include "nrf7002_bus_qspi.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define NRF7002_LOG_BUFSZ 256

/* Permanent front guard reserved at the head of every nbuf allocation.
 *
 * The NCS 802.11->Ethernet conversion in rx.c prepends a 14-byte Ethernet
 * header via nbuf_data_push() and assumes prior header-strip pulls have made
 * room.  For certain RX frames/timing that assumption is violated and the
 * 14-byte prepend moves data before the allocation start, corrupting the kmm
 * heap (observed as mm_free/mm_malloc free-list asserts under TCP RX, and as
 * an on-board nbuf "data < priv" assert on HPWORK).  Reserving a permanent
 * 16-byte (4-byte aligned, covers the 14-byte eth header) front guard keeps
 * data within [priv, priv+capacity] regardless of NCS pull/push accounting.
 */

#define NRF7002_NBUF_FRONT_HEADROOM 16

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Spinlock implementation backed by a NuttX mutex.
 * The irq_take/rel variants also save/restore the IRQ state so that
 * the FMAC layer can call them from both task and interrupt context.
 */

struct nrf7002_spinlock
{
  mutex_t      mtx;
  irqstate_t   flags; /* saved IRQ state for irq_take/rel pair */
};

/* Tasklet (work-queue item) wrapper */

struct nrf7002_tasklet
{
  struct work_s work;
  void        (*callback)(unsigned long data);
  unsigned long data;
};

/* One-shot timer wrapper (backed by LPWORK with delay) */

struct nrf7002_timer
{
  struct work_s work;
  void        (*callback)(unsigned long data);
  unsigned long data;
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Memory */

static void *nrf7002_mem_alloc(size_t size);
static void *nrf7002_mem_zalloc(size_t size);
static void  nrf7002_mem_free(void *buf);
static void *nrf7002_data_mem_zalloc(size_t size);
static void  nrf7002_data_mem_free(void *buf);
static void *nrf7002_mem_cpy(void *dest, const void *src, size_t count);
static void *nrf7002_mem_set(void *start, int val, size_t size);
static int   nrf7002_mem_cmp(const void *addr1, const void *addr2,
                              size_t size);

/* IO memory — QSPI is not memory-mapped; return NULL/no-op */

static void        *nrf7002_iomem_mmap(unsigned long addr,
                                        unsigned long size);
static void         nrf7002_iomem_unmap(volatile void *addr);
static unsigned int nrf7002_iomem_read_reg32(const volatile void *addr);
static void         nrf7002_iomem_write_reg32(volatile void *addr,
                                               unsigned int val);
static void         nrf7002_iomem_cpy_from(void *dest,
                                            const volatile void *src,
                                            size_t count);
static void         nrf7002_iomem_cpy_to(volatile void *dest,
                                          const void *src, size_t count);

/* Spinlock */

static void *nrf7002_spinlock_alloc(void);
static void  nrf7002_spinlock_free(void *lock);
static void  nrf7002_spinlock_init(void *lock);
static void  nrf7002_spinlock_take(void *lock);
static void  nrf7002_spinlock_rel(void *lock);
static void  nrf7002_spinlock_irq_take(void *lock, unsigned long *flags);
static void  nrf7002_spinlock_irq_rel(void *lock, unsigned long *flags);

/* Logging */

static int nrf7002_log_dbg(const char *fmt, va_list args);
static int nrf7002_log_info(const char *fmt, va_list args);
static int nrf7002_log_err(const char *fmt, va_list args);

/* Linked list */

static void        *nrf7002_llist_node_alloc(void);
static void         nrf7002_llist_node_free(void *node);
static void        *nrf7002_llist_node_data_get(void *node);
static void         nrf7002_llist_node_data_set(void *node, void *data);
static void        *nrf7002_llist_alloc(void);
static void         nrf7002_llist_free(void *llist);
static void         nrf7002_llist_init(void *llist);
static void         nrf7002_llist_add_node_tail(void *llist, void *node);
static void         nrf7002_llist_add_node_head(void *llist, void *node);
static void        *nrf7002_llist_get_node_head(void *llist);
static void        *nrf7002_llist_get_node_nxt(void *llist, void *node);
static void         nrf7002_llist_del_node(void *llist, void *node);
static unsigned int nrf7002_llist_len(void *llist);

/* Network buffer */

static void        *nrf7002_nbuf_alloc(unsigned int size);
static void         nrf7002_nbuf_free(void *nbuf);
static void         nrf7002_nbuf_headroom_res(void *nbuf, unsigned int size);
static unsigned int nrf7002_nbuf_headroom_get(void *nbuf);
static unsigned int nrf7002_nbuf_data_size(void *nbuf);
static void        *nrf7002_nbuf_data_get(void *nbuf);
static void        *nrf7002_nbuf_data_put(void *nbuf, unsigned int size);
static void        *nrf7002_nbuf_data_push(void *nbuf, unsigned int size);
static void        *nrf7002_nbuf_data_pull(void *nbuf, unsigned int size);
static unsigned char nrf7002_nbuf_get_priority(void *nbuf);
static unsigned char nrf7002_nbuf_get_chksum_done(void *nbuf);
static void          nrf7002_nbuf_set_chksum_done(void *nbuf,
                                                   unsigned char done);

/* Tasklet (work queue) */

