mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
static void *nrf7002_tasklet_alloc(int type);
static void  nrf7002_tasklet_free(void *tasklet);
static void  nrf7002_tasklet_init(void *tasklet,
                                   void (*cb)(unsigned long),
                                   unsigned long data);
static void  nrf7002_tasklet_schedule(void *tasklet);
static void  nrf7002_tasklet_kill(void *tasklet);

/* Timer (one-shot timer via work queue with delay) */

static void *nrf7002_timer_alloc(void);
static void  nrf7002_timer_free(void *timer);
static void  nrf7002_timer_init(void *timer,
                                 void (*callback)(unsigned long data),
                                 unsigned long data);
static void  nrf7002_timer_schedule(void *timer, unsigned long duration_ms);
static void  nrf7002_timer_kill(void *timer);

/* Timing */

static int           nrf7002_sleep_ms(int msecs);
static int           nrf7002_delay_us(int usecs);
static unsigned long nrf7002_time_get_curr_us(void);
static unsigned int  nrf7002_time_elapsed_us(unsigned long start);
static unsigned long nrf7002_time_get_curr_ms(void);
static unsigned int  nrf7002_time_elapsed_ms(unsigned long start);

/* QSPI bus ops (implemented in nrf7002_bus_qspi.c) */

/* bus_qspi_init / dev_add / dev_rem / dev_init / dev_deinit /
 * dev_intr_reg / dev_intr_unreg / dev_host_map_get are declared in
 * nrf7002_bus_qspi.h and referenced directly in the ops struct below. */

/* Misc */

static void         nrf7002_assert(int test_val, int val,
                                    enum nrf_wifi_assert_op_type op,
                                    char *assert_msg);
static unsigned int nrf7002_strlen(const void *str);

/****************************************************************************
 * Private Functions — Memory
 ****************************************************************************/

static void *nrf7002_mem_alloc(size_t size)
{
  return kmm_malloc(size);
}

static void *nrf7002_mem_zalloc(size_t size)
{
  return kmm_zalloc(size);
}

static void nrf7002_mem_free(void *buf)
{
  kmm_free(buf);
}

/* data_mem_* use the same global heap on NuttX (no separate data pool) */

static void *nrf7002_data_mem_zalloc(size_t size)
{
  return kmm_zalloc(size);
}

static void nrf7002_data_mem_free(void *buf)
{
  kmm_free(buf);
}

static void *nrf7002_mem_cpy(void *dest, const void *src, size_t count)
{
  return memcpy(dest, src, count);
}

static void *nrf7002_mem_set(void *start, int val, size_t size)
{
  return memset(start, val, size);
}

static int nrf7002_mem_cmp(const void *addr1, const void *addr2, size_t size)
{
  return memcmp(addr1, addr2, size);
}

/****************************************************************************
 * Private Functions — IO Memory (stubs; QSPI is not memory-mapped)
 ****************************************************************************/

static void *nrf7002_iomem_mmap(unsigned long addr, unsigned long size)
{
  /* nRF7002 uses QSPI, not memory-mapped IO.  The HAL only calls this
   * for PCIe targets; return NULL to indicate unsupported.
   */

  (void)addr;
  (void)size;
  return NULL;
}

static void nrf7002_iomem_unmap(volatile void *addr)
{
  (void)addr;
}

static unsigned int nrf7002_iomem_read_reg32(const volatile void *addr)
{
  (void)addr;
  return 0;
}

static void nrf7002_iomem_write_reg32(volatile void *addr, unsigned int val)
{
  (void)addr;
  (void)val;
}

static void nrf7002_iomem_cpy_from(void *dest, const volatile void *src,
                                    size_t count)
{
  (void)dest;
  (void)src;
  (void)count;
}

static void nrf7002_iomem_cpy_to(volatile void *dest, const void *src,
                                   size_t count)
{
  (void)dest;
  (void)src;
  (void)count;
}

/****************************************************************************
 * Private Functions — Spinlock
 ****************************************************************************/

static void *nrf7002_spinlock_alloc(void)
{
  struct nrf7002_spinlock *lock;

  lock = kmm_zalloc(sizeof(*lock));
  if (lock == NULL)
    {
      syslog(LOG_ERR, "nrf7002: spinlock_alloc OOM\n");
    }

  return lock;
}

static void nrf7002_spinlock_free(void *lock)
{
  kmm_free(lock);
}

static void nrf7002_spinlock_init(void *lock)
{
  struct nrf7002_spinlock *sl = lock;

  nxmutex_init(&sl->mtx);
}

static void nrf7002_spinlock_take(void *lock)
{
  struct nrf7002_spinlock *sl = lock;

  nxmutex_lock(&sl->mtx);
}

static void nrf7002_spinlock_rel(void *lock)
{
  struct nrf7002_spinlock *sl = lock;

  nxmutex_unlock(&sl->mtx);
}

static void nrf7002_spinlock_irq_take(void *lock, unsigned long *flags)
{
  struct nrf7002_spinlock *sl = lock;

  /* Mutex + interrupt mask.  This keeps handshake/ping/low-rate traffic
   * working (the QSPI completion interrupt is still serviceable across the
   * short mutex wait in practice for those paths).
   *
   * KNOWN LIMITATION: under sustained high-rate traffic (iperf) the HAL IRQ
   * handler holds this lock while draining many RPU events over QSPI, and the
   * HOSTIRQ path can re-enter the handler on the HPWORK stack and overflow it.
   * Replacing this with a pure interrupt mask deadlocks the interrupt-driven
   * nRF53 QSPI wait, and a pure mutex re-enters/overflows.  A correct fix
   * needs a polled QSPI completion path or decoupling the NCS HAL IRQ
   * re-entry (see project notes: nrf7002-wifi-handshake-fixed).
   */

  nxmutex_lock(&sl->mtx);

  if (flags != NULL)
    {
      *flags = 0;
    }
}

static void nrf7002_spinlock_irq_rel(void *lock, unsigned long *flags)
{
  struct nrf7002_spinlock *sl = lock;

  (void)flags;
  nxmutex_unlock(&sl->mtx);
}

/****************************************************************************
 * Private Functions — Logging
 ****************************************************************************/

static int nrf7002_log_dbg(const char *fmt, va_list args)
{
  char buf[NRF7002_LOG_BUFSZ];

  vsnprintf(buf, sizeof(buf), fmt, args);
  syslog(LOG_DEBUG, "nrf7002: %s\n", buf);
  return 0;
}

