mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
static int nrf7002_log_info(const char *fmt, va_list args)
{
  char buf[NRF7002_LOG_BUFSZ];

  vsnprintf(buf, sizeof(buf), fmt, args);
  syslog(LOG_INFO, "nrf7002: %s\n", buf);
  return 0;
}

static int nrf7002_log_err(const char *fmt, va_list args)
{
  char buf[NRF7002_LOG_BUFSZ];

  vsnprintf(buf, sizeof(buf), fmt, args);
  syslog(LOG_ERR, "nrf7002: %s\n", buf);
  return 0;
}

/****************************************************************************
 * Private Functions — Linked List
 *
 * The NCS FMAC uses an opaque singly-linked list API.  We implement it
 * with a simple struct wrapping a next pointer and a data pointer.
 ****************************************************************************/

static void *nrf7002_llist_node_alloc(void)
{
  struct nrf7002_llist_node *node;

  node = kmm_zalloc(sizeof(*node));
  if (node == NULL)
    {
      syslog(LOG_ERR, "nrf7002: llist_node_alloc OOM\n");
    }

  return node;
}

static void nrf7002_llist_node_free(void *node)
{
  kmm_free(node);
}

static void *nrf7002_llist_node_data_get(void *node)
{
  return ((struct nrf7002_llist_node *)node)->data;
}

static void nrf7002_llist_node_data_set(void *node, void *data)
{
  ((struct nrf7002_llist_node *)node)->data = data;
}

static void *nrf7002_llist_alloc(void)
{
  struct nrf7002_llist *llist;

  llist = kmm_zalloc(sizeof(*llist));
  if (llist == NULL)
    {
      syslog(LOG_ERR, "nrf7002: llist_alloc OOM\n");
    }

  return llist;
}

static void nrf7002_llist_free(void *llist)
{
  kmm_free(llist);
}

static void nrf7002_llist_init(void *llist)
{
  struct nrf7002_llist *l = llist;

  l->head = NULL;
  l->len  = 0;
}

static void nrf7002_llist_add_node_tail(void *llist, void *llist_node)
{
  struct nrf7002_llist      *l    = llist;
  struct nrf7002_llist_node *node = llist_node;
  struct nrf7002_llist_node *cur;

  node->next = NULL;

  if (l->head == NULL)
    {
      l->head = node;
    }
  else
    {
      cur = l->head;
      while (cur->next != NULL)
        {
          cur = cur->next;
        }

      cur->next = node;
    }

  l->len++;
}

static void nrf7002_llist_add_node_head(void *llist, void *llist_node)
{
  struct nrf7002_llist      *l    = llist;
  struct nrf7002_llist_node *node = llist_node;

  node->next = l->head;
  l->head    = node;
  l->len++;
}

static void *nrf7002_llist_get_node_head(void *llist)
{
  struct nrf7002_llist *l = llist;

  return l->head;
}

static void *nrf7002_llist_get_node_nxt(void *llist, void *llist_node)
{
  (void)llist;
  return ((struct nrf7002_llist_node *)llist_node)->next;
}

static void nrf7002_llist_del_node(void *llist, void *llist_node)
{
  struct nrf7002_llist      *l    = llist;
  struct nrf7002_llist_node *node = llist_node;
  struct nrf7002_llist_node *cur;
  struct nrf7002_llist_node *prev = NULL;

  cur = l->head;
  while (cur != NULL)
    {
      if (cur == node)
        {
          if (prev == NULL)
            {
              l->head = cur->next;
            }
          else
            {
              prev->next = cur->next;
            }

          l->len--;
          return;
        }

      prev = cur;
      cur  = cur->next;
    }
}

static unsigned int nrf7002_llist_len(void *llist)
{
  return ((struct nrf7002_llist *)llist)->len;
}

/****************************************************************************
 * Private Functions — Network Buffer
 *
 * A two-allocation scheme: one for the nrf7002_nbuf descriptor, one for
 * the raw payload.  The 'priv' field points to the raw allocation;
 * 'data' and 'tail' walk through it.
 ****************************************************************************/

static void *nrf7002_nbuf_alloc(unsigned int size)
{
  struct nrf7002_nbuf *nbuf;
  unsigned int         alloc_size;

  if (size > UINT_MAX - NRF7002_NBUF_FRONT_HEADROOM)
    {
      return NULL;
    }

  alloc_size = size + NRF7002_NBUF_FRONT_HEADROOM;

  nbuf = kmm_zalloc(sizeof(*nbuf));
  if (nbuf == NULL)
    {
      return NULL;
    }

  nbuf->priv = kmm_zalloc(alloc_size);
  if (nbuf->priv == NULL)
    {
      kmm_free(nbuf);
      return NULL;
    }

  /* Start data/tail past the permanent front guard so NCS's unchecked
   * Ethernet-header prepend (data_push) cannot move data before priv.
   */

  nbuf->data     = (unsigned char *)nbuf->priv + NRF7002_NBUF_FRONT_HEADROOM;
  nbuf->tail     = nbuf->data;
  nbuf->len      = 0;
  nbuf->headroom = NRF7002_NBUF_FRONT_HEADROOM;
  nbuf->capacity = alloc_size;

  return nbuf;
}

static void nrf7002_nbuf_free(void *nbuf_ptr)
{
  struct nrf7002_nbuf *nbuf = nbuf_ptr;

  if (nbuf == NULL)
    {
      return;
    }

  kmm_free(nbuf->priv);
  kmm_free(nbuf);
}

/* Validate nbuf pointer invariants.  Any nbuf mutation that moves data/tail
 * outside [priv, priv+capacity] would corrupt the kmm heap; assert at the
 * mutation site (in debug builds) instead of much later in mm_malloc/mm_free.
 */

#define NRF7002_NBUF_CHECK(nbuf)                                            \
  do                                                                       \
    {                                                                      \
      DEBUGASSERT((nbuf)->priv != NULL);                                   \
      DEBUGASSERT((nbuf)->data >= (unsigned char *)(nbuf)->priv);          \
      DEBUGASSERT((nbuf)->tail >= (nbuf)->data);                           \
      DEBUGASSERT((nbuf)->tail <=                                          \
                  (unsigned char *)(nbuf)->priv + (nbuf)->capacity);       \
      DEBUGASSERT((nbuf)->len == (int)((nbuf)->tail - (nbuf)->data));      \
      DEBUGASSERT((nbuf)->headroom ==                                      \
                  (int)((nbuf)->data - (unsigned char *)(nbuf)->priv));    \
    }                                                                      \
  while (0)

static void nrf7002_nbuf_headroom_res(void *nbuf_ptr, unsigned int size)
{
  struct nrf7002_nbuf *nbuf = nbuf_ptr;

  nbuf->data     += size;
  nbuf->tail     += size;
  nbuf->headroom += size;
  NRF7002_NBUF_CHECK(nbuf);
}

