mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
static unsigned int nrf7002_nbuf_headroom_get(void *nbuf_ptr)
{
  return (unsigned int)((struct nrf7002_nbuf *)nbuf_ptr)->headroom;
}

static unsigned int nrf7002_nbuf_data_size(void *nbuf_ptr)
{
  return (unsigned int)((struct nrf7002_nbuf *)nbuf_ptr)->len;
}

static void *nrf7002_nbuf_data_get(void *nbuf_ptr)
{
  return ((struct nrf7002_nbuf *)nbuf_ptr)->data;
}

static void *nrf7002_nbuf_data_put(void *nbuf_ptr, unsigned int size)
{
  struct nrf7002_nbuf *nbuf = nbuf_ptr;
  unsigned char       *data = nbuf->tail;

  nbuf->tail += size;
  nbuf->len  += size;
  NRF7002_NBUF_CHECK(nbuf);

  return data;
}

static void *nrf7002_nbuf_data_push(void *nbuf_ptr, unsigned int size)
{
  struct nrf7002_nbuf *nbuf = nbuf_ptr;

  nbuf->data     -= size;
  nbuf->headroom -= size;
  nbuf->len      += size;
  NRF7002_NBUF_CHECK(nbuf);

  return nbuf->data;
}

static void *nrf7002_nbuf_data_pull(void *nbuf_ptr, unsigned int size)
{
  struct nrf7002_nbuf *nbuf = nbuf_ptr;

  nbuf->data     += size;
  nbuf->headroom += size;
  nbuf->len      -= size;
  NRF7002_NBUF_CHECK(nbuf);

  return nbuf->data;
}

static unsigned char nrf7002_nbuf_get_priority(void *nbuf_ptr)
{
  return ((struct nrf7002_nbuf *)nbuf_ptr)->priority;
}

static unsigned char nrf7002_nbuf_get_chksum_done(void *nbuf_ptr)
{
  return (unsigned char)((struct nrf7002_nbuf *)nbuf_ptr)->chksum_done;
}

static void nrf7002_nbuf_set_chksum_done(void *nbuf_ptr,
                                          unsigned char chksum_done)
{
  ((struct nrf7002_nbuf *)nbuf_ptr)->chksum_done = (bool)chksum_done;
}

/****************************************************************************
 * Private Functions — Tasklet (work queue)
 *
 * The NCS FMAC uses "tasklets" to defer interrupt processing.  We map
 * them to NuttX work queue items.  type==0 → LPWORK (normal priority),
 * type!=0 → HPWORK (used by the IRQ handler path).
 ****************************************************************************/

static void nrf7002_tasklet_worker(FAR void *arg)
{
  struct nrf7002_tasklet *t = arg;

  /* RX hot path on HPWORK: no syslog (gates EAPOL M4 latency). */

  t->callback(t->data);
}

static void *nrf7002_tasklet_alloc(int type)
{
  struct nrf7002_tasklet *t;

  t = kmm_zalloc(sizeof(*t));
  if (t == NULL)
    {
      syslog(LOG_ERR, "nrf7002: tasklet_alloc OOM\n");
    }

  return t;
}

static void nrf7002_tasklet_free(void *tasklet)
{
  kmm_free(tasklet);
}

static void nrf7002_tasklet_init(void *tasklet,
                                  void (*callback)(unsigned long data),
                                  unsigned long data)
{
  struct nrf7002_tasklet *t = tasklet;

  t->callback = callback;
  t->data     = data;
}

static void nrf7002_tasklet_schedule(void *tasklet)
{
  struct nrf7002_tasklet *t = tasklet;

  work_queue(HPWORK, &t->work, nrf7002_tasklet_worker, t, 0);
}

static void nrf7002_tasklet_kill(void *tasklet)
{
  struct nrf7002_tasklet *t = tasklet;

  work_cancel(HPWORK, &t->work);
}

/****************************************************************************
 * Private Functions — Timer
 *
 * NCS one-shot timer: allocate, init with callback+data, schedule with
 * duration_ms, kill to cancel.  Backed by LPWORK with delay.
 ****************************************************************************/

static void nrf7002_timer_worker(FAR void *arg)
{
  struct nrf7002_timer *t = arg;

  if (t->callback)
    {
      t->callback(t->data);
    }
}

static void *nrf7002_timer_alloc(void)
{
  struct nrf7002_timer *t;

  t = kmm_zalloc(sizeof(*t));
  if (t == NULL)
    {
      syslog(LOG_ERR, "nrf7002: timer_alloc OOM\n");
    }

  return t;
}

static void nrf7002_timer_free(void *timer)
{
  kmm_free(timer);
}

static void nrf7002_timer_init(void *timer,
                                void (*callback)(unsigned long data),
                                unsigned long data)
{
  struct nrf7002_timer *t = timer;

  t->callback = callback;
  t->data     = data;
}

static void nrf7002_timer_schedule(void *timer, unsigned long duration_ms)
{
  struct nrf7002_timer *t = timer;
  clock_t delay_ticks;

  delay_ticks = (clock_t)((duration_ms * CLOCKS_PER_SEC) / 1000);
  if (delay_ticks == 0)
    {
      delay_ticks = 1;
    }

  work_queue(LPWORK, &t->work, nrf7002_timer_worker, t, delay_ticks);
}

static void nrf7002_timer_kill(void *timer)
{
  struct nrf7002_timer *t = timer;

  work_cancel(LPWORK, &t->work);
}

/****************************************************************************
 * Private Functions — Timing
 ****************************************************************************/

static int nrf7002_sleep_ms(int msecs)
{
  nxsig_usleep((useconds_t)msecs * 1000);
  return 0;
}

static int nrf7002_delay_us(int usecs)
{
  nxsig_usleep((useconds_t)usecs);
  return 0;
}

static unsigned long nrf7002_time_get_curr_us(void)
{
  return (unsigned long)(clock_systime_ticks() *
                         (unsigned long)USEC_PER_TICK);
}

static unsigned int nrf7002_time_elapsed_us(unsigned long start_us)
{
  return (unsigned int)(nrf7002_time_get_curr_us() - start_us);
}

static unsigned long nrf7002_time_get_curr_ms(void)
{
  return (unsigned long)(clock_systime_ticks() *
                         (unsigned long)MSEC_PER_TICK);
}

static unsigned int nrf7002_time_elapsed_ms(unsigned long start_ms)
{
  return (unsigned int)(nrf7002_time_get_curr_ms() - start_ms);
}

/****************************************************************************
 * Private Functions — Misc
 ****************************************************************************/

static void nrf7002_assert(int test_val, int val,
                            enum nrf_wifi_assert_op_type op,
                            char *assert_msg)
{
  bool pass;

  switch (op)
    {
      case NRF_WIFI_ASSERT_EQUAL_TO:
        pass = (test_val == val);
        break;
      case NRF_WIFI_ASSERT_NOT_EQUAL_TO:
        pass = (test_val != val);
        break;
      case NRF_WIFI_ASSERT_LESS_THAN:
        pass = (test_val < val);
        break;
      case NRF_WIFI_ASSERT_LESS_THAN_EQUAL_TO:
        pass = (test_val <= val);
        break;
      case NRF_WIFI_ASSERT_GREATER_THAN:
        pass = (test_val > val);
        break;
      case NRF_WIFI_ASSERT_GREATER_THAN_EQUAL_TO:
        pass = (test_val >= val);
        break;
      default:
        pass = false;
        break;
    }

  if (!pass)
    {
      syslog(LOG_CRIT, "nrf7002 ASSERT: %s\n",
             assert_msg ? assert_msg : "(no message)");
      PANIC();
    }
}

