mooyakoo/nuttx/drivers/wireless/ieee80211/nrf7002/nrf7002_osal.c
static unsigned int nrf7002_strlen(const void *str)
{
  return (unsigned int)strlen((const char *)str);
}

/****************************************************************************
 * Public Data
 ****************************************************************************/

const struct nrf_wifi_osal_ops nrf7002_osal_ops =
{
  /* Memory */

  .mem_alloc        = nrf7002_mem_alloc,
  .mem_zalloc       = nrf7002_mem_zalloc,
  .mem_free         = nrf7002_mem_free,
  .data_mem_zalloc  = nrf7002_data_mem_zalloc,
  .data_mem_free    = nrf7002_data_mem_free,
  .mem_cpy          = nrf7002_mem_cpy,
  .mem_set          = nrf7002_mem_set,
  .mem_cmp          = nrf7002_mem_cmp,

  /* IO memory (stubs) */

  .iomem_mmap        = nrf7002_iomem_mmap,
  .iomem_unmap       = nrf7002_iomem_unmap,
  .iomem_read_reg32  = nrf7002_iomem_read_reg32,
  .iomem_write_reg32 = nrf7002_iomem_write_reg32,
  .iomem_cpy_from    = nrf7002_iomem_cpy_from,
  .iomem_cpy_to      = nrf7002_iomem_cpy_to,

  /* QSPI bus ops — implemented in nrf7002_bus_qspi.c */

  .qspi_read_reg32  = nrf7002_qspi_read_reg32,
  .qspi_write_reg32 = nrf7002_qspi_write_reg32,
  .qspi_cpy_from    = nrf7002_qspi_cpy_from,
  .qspi_cpy_to      = nrf7002_qspi_cpy_to,

  /* SPI ops (not used; set to NULL) */

  .spi_read_reg32   = NULL,
  .spi_write_reg32  = NULL,
  .spi_cpy_from     = NULL,
  .spi_cpy_to       = NULL,

  /* Spinlock */

  .spinlock_alloc    = nrf7002_spinlock_alloc,
  .spinlock_free     = nrf7002_spinlock_free,
  .spinlock_init     = nrf7002_spinlock_init,
  .spinlock_take     = nrf7002_spinlock_take,
  .spinlock_rel      = nrf7002_spinlock_rel,
  .spinlock_irq_take = nrf7002_spinlock_irq_take,
  .spinlock_irq_rel  = nrf7002_spinlock_irq_rel,

  /* Logging */

  .log_dbg  = nrf7002_log_dbg,
  .log_info = nrf7002_log_info,
  .log_err  = nrf7002_log_err,

  /* Linked list */

  .llist_node_alloc      = nrf7002_llist_node_alloc,
  .ctrl_llist_node_alloc = nrf7002_llist_node_alloc,
  .llist_node_free       = nrf7002_llist_node_free,
  .ctrl_llist_node_free  = nrf7002_llist_node_free,
  .llist_node_data_get   = nrf7002_llist_node_data_get,
  .llist_node_data_set   = nrf7002_llist_node_data_set,
  .llist_alloc           = nrf7002_llist_alloc,
  .ctrl_llist_alloc      = nrf7002_llist_alloc,
  .llist_free            = nrf7002_llist_free,
  .ctrl_llist_free       = nrf7002_llist_free,
  .llist_init            = nrf7002_llist_init,
  .llist_add_node_tail   = nrf7002_llist_add_node_tail,
  .llist_add_node_head   = nrf7002_llist_add_node_head,
  .llist_get_node_head   = nrf7002_llist_get_node_head,
  .llist_get_node_nxt    = nrf7002_llist_get_node_nxt,
  .llist_del_node        = nrf7002_llist_del_node,
  .llist_len             = nrf7002_llist_len,

  /* Network buffer */

  .nbuf_alloc           = nrf7002_nbuf_alloc,
  .nbuf_free            = nrf7002_nbuf_free,
  .nbuf_headroom_res    = nrf7002_nbuf_headroom_res,
  .nbuf_headroom_get    = nrf7002_nbuf_headroom_get,
  .nbuf_data_size       = nrf7002_nbuf_data_size,
  .nbuf_data_get        = nrf7002_nbuf_data_get,
  .nbuf_data_put        = nrf7002_nbuf_data_put,
  .nbuf_data_push       = nrf7002_nbuf_data_push,
  .nbuf_data_pull       = nrf7002_nbuf_data_pull,
  .nbuf_get_priority    = nrf7002_nbuf_get_priority,
  .nbuf_get_chksum_done = nrf7002_nbuf_get_chksum_done,
  .nbuf_set_chksum_done = nrf7002_nbuf_set_chksum_done,

  /* Tasklet */

  .tasklet_alloc    = nrf7002_tasklet_alloc,
  .tasklet_free     = nrf7002_tasklet_free,
  .tasklet_init     = nrf7002_tasklet_init,
  .tasklet_schedule = nrf7002_tasklet_schedule,
  .tasklet_kill     = nrf7002_tasklet_kill,

  /* Timer — only present in struct when NRF_WIFI_LOW_POWER is defined */

#if defined(NRF_WIFI_LOW_POWER)
  .timer_alloc    = nrf7002_timer_alloc,
  .timer_free     = nrf7002_timer_free,
  .timer_init     = nrf7002_timer_init,
  .timer_schedule = nrf7002_timer_schedule,
  .timer_kill     = nrf7002_timer_kill,
#endif

  /* Timing */

  .sleep_ms         = nrf7002_sleep_ms,
  .delay_us         = nrf7002_delay_us,
  .time_get_curr_us = nrf7002_time_get_curr_us,
  .time_elapsed_us  = nrf7002_time_elapsed_us,
  .time_get_curr_ms = nrf7002_time_get_curr_ms,
  .time_elapsed_ms  = nrf7002_time_elapsed_ms,

  /* PCIe bus ops — not used on nRF5340; leave NULL */

  .bus_pcie_init           = NULL,
  .bus_pcie_deinit         = NULL,
  .bus_pcie_dev_add        = NULL,
  .bus_pcie_dev_rem        = NULL,
  .bus_pcie_dev_init       = NULL,
  .bus_pcie_dev_deinit     = NULL,
  .bus_pcie_dev_intr_reg   = NULL,
  .bus_pcie_dev_intr_unreg = NULL,
  .bus_pcie_dev_dma_map    = NULL,
  .bus_pcie_dev_dma_unmap  = NULL,
  .bus_pcie_dev_host_map_get = NULL,

  /* QSPI bus lifecycle — implemented in nrf7002_bus_qspi.c */

  .bus_qspi_init             = nrf7002_qspi_bus_init,
  .bus_qspi_deinit           = nrf7002_qspi_bus_deinit,
  .bus_qspi_dev_add          = nrf7002_qspi_dev_add,
  .bus_qspi_dev_rem          = nrf7002_qspi_dev_rem,
  .bus_qspi_dev_init         = nrf7002_qspi_dev_init,
  .bus_qspi_dev_deinit       = nrf7002_qspi_dev_deinit,
  .bus_qspi_dev_intr_reg     = nrf7002_qspi_dev_intr_reg,
  .bus_qspi_dev_intr_unreg   = nrf7002_qspi_dev_intr_unreg,
  .bus_qspi_dev_host_map_get = nrf7002_qspi_dev_host_map_get,

  /* SPI bus lifecycle — not used; leave NULL */

  .bus_spi_init             = NULL,
  .bus_spi_deinit           = NULL,
  .bus_spi_dev_add          = NULL,
  .bus_spi_dev_rem          = NULL,
  .bus_spi_dev_init         = NULL,
  .bus_spi_dev_deinit       = NULL,
  .bus_spi_dev_intr_reg     = NULL,
  .bus_spi_dev_intr_unreg   = NULL,
  .bus_spi_dev_host_map_get = NULL,

  /* Misc */

  .assert = nrf7002_assert,
  .strlen = nrf7002_strlen,
};
